sylvanwilliams/ODR-1_Firmware/DSPIC33E_hardware.c
/******************************************************************************
* DSPIC33E_hardware.c
* This code contains routines to initialize  and configure
* the dsPIC33EP512MU810 internal hardware and I/O pins.
*
* This work is licensed under the Creative Commons Attribution-ShareAlike
* 4.0 International License. To view a copy of this license, visit
* http://creativecommons.org/licenses/by-sa/4.0/ or send a letter to
* Creative Commons, PO Box 1866, Mountain View, CA 94042, USA.
******************************************************************************/

// #if defined(__dsPIC33E__)
// #include "p33exxxx.h"
// #elif defined(__PIC24E__)
// #include "p24exxxx.h"
// #endif
// #include "main.h"
#include "p33EP512MU810.h"
#include "DSPIC33E_hardware.h"
#include "si5351a.h"
/*******************************************************************************
* Initialize I2C #2
* 
* 
*******************************************************************************/
void Init_I2C2(void)	
{
    ODCFbits.ODCF4 = 1; // Open drain contol bits
    ODCFbits.ODCF5 = 1;

        I2C2CON = 0;			// stop & clear I2C unit
	I2C2STAT = 0;
	I2C2RCV	= 0;
	I2C2TRN	= 0;
	I2C2ADD	= 0;			// Master address
	I2C2MSK	= 0;

	I2C2BRG	= 511;      // set I2C clock rate 511=114kHz,135 = 400kHz

	I2C2CONbits.A10M = 0;	// 7-bit address
        I2C2CONbits.SCLREL = 1;
	I2C2CONbits.I2CEN = 1;	// enable I2C unit
}

/*******************************************************************************
* I2C #2 Write single byte
* 
* 
*******************************************************************************/
// Write one byte

void I2C2_Byte_Write	( unsigned char Write_Address, unsigned char Write_Data )
{
//	set_i2c_timeout();			// arm I2C timeout

	I2C2CONbits.SEN	= 1;			// start condition enable bit
	while (I2C2CON & 0b11111);
	
	I2C2TRN	= SI5351_BUS_BASE_ADDR;		// slave address
	while (I2C2STATbits.TRSTAT);		// wait while transmit status true
	
	I2C2TRN	= Write_Address;		// register address
	while (I2C2STATbits.TRSTAT);		// wait while transmit status true

	I2C2TRN	= Write_Data;			// data
	while (I2C2STATbits.TRSTAT);		// wait while transmit status true
	
	I2C2CONbits.PEN	= 1;			// stop condition enable bit
	while (I2C2CONbits.PEN);
}

/*******************************************************************************
* I2C #2 Read single byte
* 
* 
*******************************************************************************/	
// read one byte

void I2C2_Byte_Read ( unsigned char Read_Address )
{
	unsigned char	Read_Data;

//	set_i2c_timeout();					// arm I2C timeout
	
	I2C2CONbits.SEN	= 1;				// start condition
	while (I2C2CONbits.SEN);
	
	I2C2TRN	= SI5351_BUS_BASE_ADDR;			// slave address
	while (I2C2STATbits.TRSTAT);

	I2C2TRN	= Read_Address;				// register address
	while (I2C2STATbits.TRSTAT);

	I2C2CONbits.RSEN = 1;				// repeat start condition
	while (I2C2CONbits.RSEN);
	
	I2C2TRN	= SI5351_BUS_BASE_ADDR | 0x01;		// slave address again with Read bit
	while (I2C2STATbits.TRSTAT);

	while (I2C2STATbits.ACKSTAT);                   // wait for Ack

	I2C2CONbits.RCEN = 1;				// receive enable
	while (I2C2CONbits.RCEN);

	Read_Data = I2C2RCV;				// read data

	I2C2CONbits.ACKDT =	1;			// send Ack
	I2C2CONbits.ACKEN =	1;
	while (I2C2CONbits.ACKEN);

	I2C2CONbits.PEN	= 1;				// stop condition
	while (I2C2CONbits.PEN);

}

/*******************************************************************************
* Initialize SPI #1 Used for Audio Codec
*
*
*******************************************************************************/
void Init_SPI1()

{
    // setup the SPI1 peripheral
    SPI1STAT = 0x0;                     // disable the SPI module (just in case)
    SPI1CON1 = SPI1CON1_INIT;           // see header file for SPI1 configuration
    SPI1CON2 = SPI1CON2_INIT;           // see header file for SPI1 configuration
    SPI1STAT = 0x8000;                  // enable the SPI1 module
}

/*******************************************************************************
* Initialize SPI #2 Used for the LCD Display
* 
* 
*******************************************************************************/
void Init_SPI2()
//void Init_SPI2(int cke, int ckp)
{

    // setup the SPI2 peripheral
    SPI2STAT = 0x0;                     // disable the SPI module (just in case)
    IFS2bits.SPI2IF = 0;                //Clear interrupt flag
    SPI2STATbits.SISEL = 3;             //Select interrupt mode for SRRBF full
    IEC2bits.SPI2IE = 0;                //Enable SPI2 interrupt
    IPC8bits.SPI2IP = 2;                //Set priority one higher than main timer
    
    SPI2CON1 = SPI2CON1_INIT;           // see header file for SPI2 configuration
    SPI2CON2 = SPI2CON2_INIT;           // see header file for SPI2 configuration
    
    SPI2STATbits.SPIROV = 0;
    SPI2CON2bits.SPIBEN = 1;
    
    SPI2STATbits.SPIEN = 1;
// Another way to configure the SPI2CON1 register
//		SPI2CON1bits.CKP=0;         // Idle state for clock is a low level
//		SPI2CON1bits.CKE=1;         // Data out on Active to Idle Edge
//		SPI2CON1bits.MODE16=1       // 16-bit data transfer mode
//		SPI2CON1bits.MSTEN=1;       // Enable Master mode
//		SPI2CON1bits.SPRE=6;        // Set Secondary Pre-scalar for 2:1 ratio
//		SPI2CON1bits.PPRE =   2;    // Set Primary Pre-scalar for 4:1 ratio
// 		SPI2CON1bits.DISSDO = 0;    // Enable SDO output
//		SPI2CON1bits.DISSCK = 0;    // Enable SCK output

}

/*******************************************************************************
* Initialize SPI #3 Used for Ethernet
*
*
*******************************************************************************/
void Init_SPI3()

{
    // setup the SPI3 peripheral
    SPI3STAT = 0x0;                     // disable the SPI module (just in case)
    SPI3CON1 = SPI3CON1_INIT;           // see header file for SPI3 configuration
    SPI3CON2 = SPI3CON2_INIT;           // see header file for SPI3 configuration
    SPI3STAT = 0x8000;                  // enable the SPI3 module
}

