sylvanwilliams/ODR-1_Firmware/DSPIC33E_hardware.c
/*******************************************************************************
* Initialize SPI #4 Used for EEPROM
*
*
*******************************************************************************/
void Init_SPI4()

{
    // setup the SPI4 peripheral
    SPI4STAT = 0x0;                     // disable the SPI module (just in case)
    SPI4CON1 = SPI4CON1_INIT;           // see header file for SPI4 configuration
    SPI4CON2 = SPI4CON2_INIT;           // see header file for SPI4 configuration
    SPI4STAT = 0x8000;                  // enable the SPI4 module
}


/*******************************************************************************
* Initialize DSPIC33E Oscillator
* 
* 
*******************************************************************************/
void Init_P33EP512MU810_osc()
{
// Configure Oscillator to operate the device at 120Mhz
   // Fosc= Fin*M/(N1*N2), Fcy=Fosc/2
   // Fosc= 12M*40/(2*2)=120Mhz for 8M input clock PLLFBD=58
   PLLFBD             = 38;         // PLL Feedback Divisor bits (M = PLLFBD + 2)
   
   CLKDIVbits.ROI     = 0;          // Recover on Interrupt, no effect on DOZEN
   CLKDIVbits.DOZE    = 0b000;      // Fcy divided by 1
   CLKDIVbits.DOZEN   = 0;          // DOZE disabled, peripheral clock ratio forced to 1:1
   CLKDIVbits.FRCDIV  = 0b000;      // Internal Fast RC divided by 1 (default)
   CLKDIVbits.PLLPOST = 0;          // N1=2
   CLKDIVbits.PLLPRE  = 0;          // N2=2

   OSCTUN             = 0;          // Tune FRC oscillator, if FRC is used

   REFOCONbits.ROON   = 0;          // Disable Reference Clock output before making changes
   REFOCONbits.ROSSLP = 0;          // Reference oscillator output is disabled in Sleep
   REFOCONbits.ROSEL  = 0;          // System clock used as the reference clock
   REFOCONbits.RODIV  = 0;          // Reference Oscillator Divider bits
   REFOCONbits.ROON   = 0;          // Enable Reference Clock if needed

   ACLKCON3bits.ENAPLL   = 0;       // Enable Auxiliary PLL (APLL) Disabled
   ACLKCON3bits.SELACLK  = 0;       // Select Auxiliary Clock Source
   ACLKCON3bits.AOSCMD   = 0;       // Auxiliary Oscillator Mode bits
   ACLKCON3bits.ASRCSEL  = 0;       // Select Reference Clock Source for APLL bit
   ACLKCON3bits.FRCSEL   = 0;       // Select FRC as Reference Clock Source for APLL bit
   ACLKCON3bits.APLLPOST = 0b000;   // Select PLL VCO Output Divider bits
   ACLKCON3bits.APLLPRE  = 0b000;   // PLL Phase Detector Input Divider bits

   ACLKDIV3bits.APLLDIV  = 0b000;   // PLL Feedback Divisor bits (PLL multiplier ratio)

   RCONbits.SWDTEN=0;               // Disable Watch Dog Timer if enabled in fuse bit

// Clock switching to incorporate PLL
   __builtin_write_OSCCONH(0x03);      // Clock Switch to Primary Osc with PLL (NOSC=0b011)
   //__builtin_write_OSCCONL(0x01);    // Start clock switching
   __builtin_write_OSCCONL(0x03);      // Start clock switching and turn on LP 32kHz oscillator
   while (OSCCONbits.COSC!= 0b011);    // Wait for Clock switch to occur
   while (OSCCONbits.LOCK!= 1);        // Wait for PLL to lock

}

/*******************************************************************************
* Initialize Reference Clock output used for Codec M-Clock
* Using 12MHz main oscillator clock passed straight through
*
*******************************************************************************/
void Init_REFCLK()

{
    // Setup REFOCON Register
    REFOCONbits.RODIV  = 0b0000;    // Reference Oscillator Divider bits
    REFOCONbits.ROSEL  = 0b1;       // Reference Oscillator Source Select bit
    REFOCONbits.ROSSLP = 0b0;       // Reference Oscillator Run in Sleep bit
    REFOCONbits.ROON   = 0b1;       // Reference Oscillator Output Enable
}

/*******************************************************************************
* Initialize DSPIC33E I/O pins
* 
* 
*******************************************************************************/
void Init_P33EP512MU810_pins()
{
    // Set general I/O
    TRISA = 0x0081;    // PortA 0000 0000 1000 0001 (In=RA0,RA7)
    PORTA = 0x0000;

    TRISB = 0x0000;    // PortB 0000 0000 0000 0000
    PORTB = 0x0000;

    TRISC = 0x001E;    // PortC 0000 0000 0001 1110 (In=RC1-RC4)
    PORTC = 0x0000;

    TRISD = 0x1010;    // PortD 0001 0000 0001 0000 (In RD4,RD12)
    PORTD = 0x0000;

    TRISE = 0x0008;    // PortE 0000 0000 0000 1000 (In RE3, )
    PORTE = 0x0000;

    TRISF = 0x0001;    // PortF 0000 0000 0000 0001 (In RF0)
    PORTF = 0x0000;

    // Configure LCD Data / Command/data Pin
    TRISG = 0x6280;    // PortG 0110 0010 1000 0000 (In=RG7,RG9,RG13,RG14)
    PORTG = 0x0000;

    ANSELA = 0x0000;   //Configure analog inputs
    ANSELB = 0x0000;
    ANSELC = 0x0000;
    ANSELD = 0x0000;
    ANSELE = 0x0000;
    ANSELG = 0x0000;

    CNPUA = 0x0000;    // Port A Pull Up 0000 0000 1100 0000
    CNPDA = 0x0000;    // Port A Pull Down
    CNPUB = 0x0000;    // Port B Pull Up 0000 0000 0000 0000
    CNPDB = 0x0000;    // Port B Pull Down
    CNPUC = 0x0000;    // Port C Pull Up 0000 0000 0000 0000
    CNPDC = 0x0000;    // Port C Pull Down
    CNPUD = 0x0000;    // Port D Pull Up 0011 0000 0011 0000
    CNPDD = 0x0000;    // Port D Pull Down
    CNPUE = 0x0000;    // Port E Pull Up 0000 0000 0000 0010
    CNPDE = 0x0000;    // Port E Pull Down
    // CNPUF = 0x0018;    // Port F Pull Up 0000 0000 0001 1000 Pull up I2C2 SCL SDA for testing
    CNPUF = 0x0000;    // Port F Pull Up 0000 0000 0000 0000
    CNPDF = 0x0000;    // Port F Pull Down
    CNPUG = 0x0000;    // Port G Pull Up 0000 0000 0000 0000
    CNPDG = 0x0000;    // Port G Pull Down

    // Map SPI1 peripheral pins
    RPINR20bits.SDI1R = 0b1100000;    //SPI1 MISO1 to RP96 Table 11-1, 11-2
    RPOR7bits.RP97R   = 0b000101;     //SPI1 MOSI1 to RP97 Table 11-3
    RPOR12bits.RP112R = 0b000110;     //SPI1 SCK1 to RP112 Table 11-3
    RPOR13bits.RP113R = 0b000111;     //SPI1 SS1 to RP113 Table 11-3

    // Map SPI2 SS pin, other pins not remapable on dsPIC33EP512MU810
    RPOR6bits.RP87R   = 0b001010;     //LCD_CS to RE7(RP87) Table 11-3

    // Map SPI3 peripheral pins
    RPINR29bits.SDI3R = 0b1001100;    //SPI3 MISO3 to RPI76 Table 11-1, 11-2
    RPOR1bits.RP67R   = 0b000101;     //SPI3 MOSI3 to RP67 Table 11-3
    RPOR1bits.RP66R   = 0b000110;     //SPI3 SCK3 to RP66 Table 11-3
    RPOR0bits.RP65R   = 0b000111;     //SPI3 SS3 to RP65 Table 11-3

