sylvanwilliams/ODR-1_Firmware/DSPIC33E_hardware.c
    // Map SPI4 peripheral pins
    RPINR31bits.SDI4R = 0b1000100;    //SPI4 MISO4 to RP68 Table 11-1, 11-2
    RPOR3bits.RP71R   = 0b000101;     //SPI4 MOSI4 to RP71 Table 11-3
    RPOR3bits.RP70R   = 0b000110;     //SPI4 SCK4 to RP70 Table 11-3
    RPOR2bits.RP69R   = 0b000111;     //SPI4 SS4 to RP69 Table 11-3

    // Map Audio Codec clock, interrupt and DCI module pins
    RPINR24bits.CSDIR = 0b0010111;    // DCI CSDI to RA7 RPI23 Table 11-1, 11-2
    RPOR4bits.RP80R   = 0b001011;     // DCI CSDO to RE0 RP80 Table 11-3
    RPINR24bits.CSCKR = 0b1111101;    // DCI BCLK input to RP125
    RPINR25bits.COFSR = 0b1111110;    // DCI WCLK input to RP126
    RPOR5bits.RP82R   = 0b110001;     // REFCLK to RE2 RP82 Table 11-3 used for MCLK
    RPINR0bits.INT1R  = 0b1010011;    // EXT INT1 to RE3 RPI83 Table 11-1, 11-2

    // Quadrature Encoder Interface #1 pin connections
    //RPINR14bits.QEA1R  = 0b1000100;  // Connect QEI1 QEA1 input to RP68 RD4 (Table 11-2)
    //RPINR14bits.QEB1R  = 0b1000101;  // Connect QEI1 QEB1 input to RP69 RD5 (Table 11-2)
    //RPINR15bits.HOME1R = 0b1001100;  // Connect QEI1 HOME1 input to RPI76 RD12 (Table 11-2)
    //RPINR15bits.INDX1R = 0b1001101;  // Connect QEI1 INDEX1 input to RPI77 RD13 (Table 11-2
    RPINR14bits.QEA1R  = 0b0110010;  // Connect QEI1 QEA1 input to RPI50 RC2 (Table 11-2)
    RPINR14bits.QEB1R  = 0b0110100;  // Connect QEI1 QEB1 input to RPI52 RC4 (Table 11-2)
    RPINR15bits.HOME1R = 0b0000000;  // Connect QEI1 HOME1 input to Vss (Table 11-2)
    RPINR15bits.INDX1R = 0b0110011;  // Connect QEI1 INDEX1 input to RPI51 RC3 (Table 11-2

    // Quadrature Encoder Interface #2 pin connections
    //RPINR16bits.QEA2R  = 0b0010111;  // Connect QEI2 QEA2 input to RPI23 RA7 (Table 11-2)
    //RPINR16bits.QEB2R  = 0b0010110;  // Connect QEI2 QEB2 input to RPI22 RA6 (Table 11-2)
    //RPINR17bits.HOME2R = 0b1111100;  // Connect QEI2 HOME2 input to RPI124 RG12 (Table 11-2)
    //RPINR17bits.INDX2R = 0b1010001;  // Connect QEI2 INDEX2 input to RPI81 RE1 (Table 11-2)
    RPINR16bits.QEA2R  = 0b0010000;  // Connect QEI2 QEA2 input to RPI16 RA0 (Table 11-2)
    RPINR16bits.QEB2R  = 0b0110001;  // Connect QEI2 QEB2 input to RPI49 RC1 (Table 11-2)
    RPINR17bits.HOME2R = 0b0000000;  // Connect QEI2 HOME2 input to Vss (Table 11-2)
    RPINR17bits.INDX2R = 0b1111001;  // Connect QEI2 INDEX2 input to RPI121 RG9 (Table 11-2)
    
}


/*******************************************************************************
* Initialize Quadrature Encoder Interface #1 Hardware
* This input is used by the frequency encoder and has high frequency debounce
* done with on-chip hardware.
*******************************************************************************/
void Init_QEI_1()
{
    QEI1CONbits.QEIEN   = 0;      // Module counters are disabled
    QEI1CONbits.QEISIDL = 0;      // Continue module operation in Idle mode
    QEI1CONbits.PIMOD   = 0;      // Index input event does not affect position counter
    QEI1CONbits.IMV     = 0;      // Index input event does not affect position counter
    QEI1CONbits.INTDIV  = 0b111;  // Timer Input Clock Prescale 1:256
    QEI1CONbits.CNTPOL  = 0;      // Counter direction is positive
    QEI1CONbits.GATEN   = 0;      // External gate does not affect position counter
    QEI1CONbits.CCM     = 0b00;   // Quadrature Encoder mode

    QEI1IOCbits.QCAPEN  = 0;      // HOMEx input does not trigger position capture event
    QEI1IOCbits.FLTREN  = 1;      // Input Pin Digital filter is enabled
    QEI1IOCbits.QFDIV   = 0b111;  // Digital Input Filter Clock Divide 1:256
    QEI1IOCbits.OUTFNC  = 0;      // CNTCMPx output pin disabled
    QEI1IOCbits.SWPAB   = 0;      // QEAx and QEBx are not swapped
    QEI1IOCbits.HOMPOL  = 0;      // HOMEx Input Polarity not inverted
    QEI1IOCbits.IDXPOL  = 0;      // INDXx Input Polarity not inverted
    QEI1IOCbits.QEBPOL  = 0;      // QEBx Input Polarity not inverted
    QEI1IOCbits.QEAPOL  = 0;      // QEAx Input Polarity not inverted
    
    QEI1CONbits.QEIEN   = 1;      // Module counters are enabled
}

/*******************************************************************************
* Initialize Quadrature Encoder Interface #2 Hardware
* This input is used by the gain encoder and has high frequency debounce
* done with on-chip hardware.
*******************************************************************************/
void Init_QEI_2()
{
    QEI2CONbits.QEIEN   = 0;      // Module counters are disabled
    QEI2CONbits.QEISIDL = 0;      // Continue module operation in Idle mode
    QEI2CONbits.PIMOD   = 0;      // Index input event does not affect position counter
    QEI2CONbits.IMV     = 0;      // Index input event does not affect position counter
    QEI2CONbits.INTDIV  = 0b111;  // Timer Input Clock Prescale 1:256
    QEI2CONbits.CNTPOL  = 0;      // Counter direction is positive
    QEI2CONbits.GATEN   = 0;      // External gate does not affect position counter
    QEI2CONbits.CCM     = 0b00;   // Quadrature Encoder mode

    QEI2IOCbits.QCAPEN  = 0;      // HOMEx input does not trigger position capture event
    QEI2IOCbits.FLTREN  = 1;      // Input Pin Digital filter is enabled
    QEI2IOCbits.QFDIV   = 0b111;  // Digital Input Filter Clock Divide 1:256
    QEI2IOCbits.OUTFNC  = 0;      // CNTCMPx output pin disabled
    QEI2IOCbits.SWPAB   = 0;      // QEAx and QEBx are not swapped
    QEI2IOCbits.HOMPOL  = 0;      // HOMEx Input Polarity not inverted
    QEI2IOCbits.IDXPOL  = 0;      // INDXx Input Polarity not inverted
    QEI2IOCbits.QEBPOL  = 0;      // QEBx Input Polarity not inverted
    QEI2IOCbits.QEAPOL  = 0;      // QEAx Input Polarity not inverted

    QEI2CONbits.QEIEN   = 1;      // Module counters are enabled
}

/*******************************************************************************
* Initialize Pulse Width Modulators
* Period set to ~50 kHz which is above 48kHz sound card sample rate
* Currently only one of the 6 PWMs in use
* PWM1 - LCD Backlight control
*******************************************************************************/
void Init_PWM()
{
    // PTPER = Fosc /(desired period * PTCON2)
    // PTPER = 120MHz /(50kHz * 2) = 1200
    PTCON2 = 0x0001;                  // Prescaler 1=/2, 2=/4, 3=/8, 4=/16, 5=/32
    PTPER = 1200;                     // 50kHz PWM Period on Primary Time Base
    PHASE1 = 0;                       // PWM1 phase shift
    PHASE2 = 120;                     // PWM2 phase shift
    PHASE3 = 240;                     // PWM3 phase shift
    // PDCn = (desired duty cycle * PTPER)
    // PDC3 = 15000;                     // Default screen brightness to 50% Duty Cycle
    // PDC1 = PDC2 = 15000;              // Set to 50% duty, currently not used
    PDC3 = (PTPER / 2);               // Default screen brightness to 50% Duty Cycle
    PDC1 = PDC2 = (PTPER / 2);        // Set to 50% duty, currently not used
    DTR1 = DTR2 = DTR3 = 5;           // Set Dead Time Values
    ALTDTR1 = ALTDTR2 = ALTDTR3 = 5;  // Set Alternate Dead Time Values
    IOCON3 = 0xA000;                  // PWM3H pin 3 used for LCD backlight output
    IOCON1 = IOCON2 = 0x0000;         // PWM1 and PWM2 outputs Disabled
    //Set Primary Time Base, Edge-Aligned Mode and Independent Duty Cycles
    PWMCON1 = PWMCON2 = PWMCON3 = 0x0000;
    FCLCON1 = FCLCON2 = FCLCON3 = 0x0003; // Fault inputs disabled
    PTCON = 0x8000;                       // Enable PWM Module
}


