sylvanwilliams/ODR-1_Firmware/DSPIC33E_hardware.c
/*******************************************************************************
* Initialize Real Time Clock and Calendar
* Prerequisites:
*     OSCCON register bit 2 is set to enable 32kHz secondary oscillator.
*
*
*******************************************************************************/
void Init_RTCC()
{
    __builtin_write_RTCWEN(); // Enable access to the RTC registers
    RCFGCALbits.RTCEN = 0;    // Temporarily disable RTC during changes
    ALCFGRPTbits.ALRMEN = 0;  // Disable the alarms
    RCFGCALbits.RTCOE = 1;    // Enable the RTCC output pin
    PADCFG1bits.RTSECSEL = 1; // Output the 1Hz signal on the RTCC pin
    //Default the date/time to 5/3/2014, 29:59
    RCFGCALbits.RTCPTR = 3;   // Start with the year and work down
    RTCVAL = 0x14;            // Year
    RTCVAL = 0x0503;          // month and day
    RTCVAL = 0x0123;          // WDAY<10:8> HRTEN<5:4> HRONE<3:0>
    RTCVAL = 0x5900;          // MINTEN<14:12> MINONE<11:8> SECTEN<6:4> SECONE<3:0>
    RCFGCALbits.RTCEN = 1;    // Enable the RTC
    RCFGCALbits.RTCWREN = 0;  // Stop future writes to the RTC control register
}

/******************************************************************************
 * Function:       void Init_Timer1( void )
 *
 * PreCondition:   None
 *
 * Input:          None
 *
 * Output:         None
 *
 * Side Effects:   None
 *
 * Overview:       Initialize Timer1 for Period Interrupts
 *                 At 120MHz, Fcy = 60MHz or 16.666nS
 *                 With prescaler set to /64 one timer tick = 1.066uS
 *                 Configure for 12mS cycle --> PR1 = 11250
 *****************************************************************************/
void Init_Timer1( void )
{
    T1CON = 0;          // Timer reset
    T1CONbits.TCKPS = TIMER_PRESCALER;// Set prescaler to /64
    IFS0bits.T1IF = 0;  // Reset Timer1 interrupt flag
    IPC0bits.T1IP = 1;  // Timer1 Interrupt priority level=1
    IEC0bits.T1IE = 1;  // Enable Timer1 interrupt
    TMR1 = 0x0000;
    PR1 = TIMER1_PERIOD;       // Timer1 period register - see macro
    T1CONbits.TON = 1;  // Enable Timer1 and start the counter
}
/******************************************************************************
 * Function:       void Init_DCI( void )
 *
 * PreCondition:   None
 *
 * Input:          None
 *
 * Output:         None
 *
 * Side Effects:   None
 *
 * Overview: Initializes DCI interface as a slave to the audio codec.
 *              Configured for 16bit word length with 2 words per frame.
 *              ISR is fired after 2 words have been received.       
 *****************************************************************************/
void Init_DCI(void)
{

    RSCONbits.RSE1 = 1; /* Enable Receive Time Slot 1 */
    RSCONbits.RSE0 = 1; /* Enable Receive Time Slot 0 */
    TSCONbits.TSE1 = 1; /* Enable Transmit Time Slot 1 */
    TSCONbits.TSE0 = 1; /* Enable Transmit Time Slot 0 */
    
    DCICON1bits.COFSM = 0; /* Multichannel Frame Sync mode */
    DCICON1bits.DJST = 0; /* Data TX/RX is begun one serial clock cycle after frame sync pulse */
    DCICON1bits.CSCKE = 0; /* Data changes on rising edge sampled on falling edge of CSCK */
    DCICON1bits.COFSD = 1; /* Frame sync driven by codec*/
    DCICON1bits.CSCKD = 1; /* Clock is input to DCI from codec */
    DCICON2bits.BLEN = 1; /* Two data words will be buffered between interrupts */
    DCICON2bits.COFSG = 1; /* Data frame has 2 words */
    DCICON2bits.WS = 15; /* Data word size is 16 bits*/
    DCICON3 = 0; /* BCG value is zero since clock is driven by codec */
    
    IPC15bits.DCIIP = 6; /* Enable the interrupts */
    IFS3bits.DCIIF = 0;
    IEC3bits.DCIIE = 0;
    
    TXBUF0 = 0x0000;
    TXBUF1 = 0x0000;
    
    DCICON1bits.DCIEN = 1; /* Enable the module*/
    IEC3bits.DCIIE = 1;
}